## ZIP

In [1]:
a = [1,3,5,7,9]
b = [2,4,6,8,10]

In [6]:
res = []
for pos in range(0,len(a)):
    res.append(a[pos] * b[pos])
res

[2, 12, 30, 56, 90]

In [11]:
res = []
for i,j in zip(a,b):
    res.append(i *j)
res

[2, 12, 30, 56, 90]

In [12]:
[i*j for i,j in zip(a,b)]

[2, 12, 30, 56, 90]

## Numpy

In [13]:
import numpy as np

a = [1,3,5,7,9]
b = [2,4,6,8,10]

na = np.array(a)
nb = np.array(b)

In [15]:
na, nb

(array([1, 3, 5, 7, 9]), array([ 2,  4,  6,  8, 10]))

In [17]:
na + nb

array([ 3,  7, 11, 15, 19])

In [18]:
na * nb

array([ 2, 12, 30, 56, 90])

In [20]:
na = np.array([1,2,3,4,5])
na

array([1, 2, 3, 4, 5])

In [21]:
na[0]

1

In [23]:
na[-1]

5

In [25]:
na[1:3]

array([2, 3])

In [27]:
na > 3

array([False, False, False,  True,  True])

In [28]:
na[na > 3]

array([4, 5])

In [29]:
na=np.array([[1,2,3,4,5],[6,7,8,9,10]])

In [30]:
na

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10]])

In [31]:
na[0,0]

1

In [32]:
na[0,:]

array([1, 2, 3, 4, 5])

In [33]:
na[:,0]

array([1, 6])

In [34]:
na.T

array([[ 1,  6],
       [ 2,  7],
       [ 3,  8],
       [ 4,  9],
       [ 5, 10]])

In [36]:
a = [1,2,3, 'qoo','oop']
na = np.array(a)
na

array(['1', '2', '3', 'qoo', 'oop'], dtype='<U11')

In [37]:
na = np.array([['frank','M',29],['mary','F',23],['tom','M',35],['ted','M',33],['jean','F',21],['lisa','F',20]])
na

array([['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']], dtype='<U5')

In [38]:
na = np.array([ ['name', 'gender', 'age'], ['frank','M',29],['mary','F',23],['tom','M',35],['ted','M',33],['jean','F',21],['lisa','F',20]])
na

array([['name', 'gender', 'age'],
       ['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']], dtype='<U6')

## Pandas

In [39]:
import pandas as pd
df = pd.DataFrame([['frank','M',29],['mary','F',23],['tom','M',35],['ted','M',33],['jean','F',21],['lisa','F',20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [40]:
print(df)

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
0    6 non-null object
1    6 non-null object
2    6 non-null int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [43]:
df.columns = ['name', 'gender', 'age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [ ]:
https://tw.news.yahoo.com/_td-news/api/resource/IndexDataService.getExternalMediaNewsList;count=10;loadMore=true;mrs=%7B%22size%22%3A%7B%22w%22%3A220%2C%22h%22%3A128%7D%7D;newsTab=all;start=100;tag=null;usePrefetch=true?bkt=native_generalads&device=desktop&feature=videoDocking%2Cfullmodalview&intl=tw&lang=zh-Hant-TW&partner=none&prid=822gogdddnsl7&region=TW&site=news&tz=Asia%2FTaipei&ver=2.0.968&returnMeta=true
https://tw.news.yahoo.com/_td-news/api/resource/IndexDataService.getExternalMediaNewsList;count=10;loadMore=true;mrs=%7B%22size%22%3A%7B%22w%22%3A220%2C%22h%22%3A128%7D%7D;newsTab=all;start=110;tag=null;usePrefetch=true?bkt=native_generalads&device=desktop&feature=videoDocking%2Cfullmodalview&intl=tw&lang=zh-Hant-TW&partner=none&prid=822gogdddnsl7&region=TW&site=news&tz=Asia%2FTaipei&ver=2.0.968&returnMeta=true

In [48]:
import requests
news = []
for i in range(0,10):
    res = requests.get('https://tw.news.yahoo.com/_td-news/api/resource/IndexDataService.getExternalMediaNewsList;count=100;loadMore=true;mrs=%7B%22size%22%3A%7B%22w%22%3A220%2C%22h%22%3A128%7D%7D;newsTab=all;start={};tag=null;usePrefetch=true?bkt=native_generalads&device=desktop&feature=videoDocking%2Cfullmodalview&intl=tw&lang=zh-Hant-TW&partner=none&prid=822gogdddnsl7&region=TW&site=news&tz=Asia%2FTaipei&ver=2.0.968&returnMeta=true'.format(i * 10))
    news.extend(res.json()['data'])

In [51]:
import pandas
df = pandas.DataFrame(news)
df.head(3)

,content_type,id,provider_name,published_at,summary,thumbnail,title,ts_update,url
0,story,96f8ba6d-75df-33f5-b8e9-7b845c42785e,Yahoo奇摩電競,1524364360,《絕地求生》開發商 PUBG Corp 近日宣佈目前正在製作地圖選擇功能，讓玩家可以隨心所欲...,{'url': 'https://s2.yimg.com/lo/api/res/1.2/uk...,《絕地求生》開發商預告地圖選擇功能，測試伺服器搶先開放,1524364406,/%E3%80%8A%E7%B5%95%E5%9C%B0%E6%B1%82%E7%94%9F...
1,story,3cafc7df-0270-3c13-b924-712e46f51a4e,風傳媒,1524363001,美國國會轄下的「中美經濟與安全評估委員會」19日警告，由中國企業或受中國影響的企業製造的資訊...,{'url': 'https://s2.yimg.com/lo/api/res/1.2/Ph...,中美貿易戰》「中國製造」無孔不入 美國國會警告：中國資通訊科技產品暗藏國安漏洞,1524364232,/%E4%B8%AD%E7%BE%8E%E8%B2%BF%E6%98%93%E6%88%B0...
2,story,2e33526e-7590-3a2c-8680-208bbfdf6702,新頭殼,1524363946,新頭殼newtalk,NaN,不滿小屁孩用餐亂跑 狠心孕婦伸腳絆倒害腦震盪,1524364218,/%E4%B8%8D%E6%BB%BF%E5%B0%8F%E5%B1%81%E5%AD%A9...

In [50]:
df.count()

content_type     1000
id               1000
provider_name    1000
published_at     1000
summary          1000
thumbnail         543
title            1000
ts_update        1000
url              1000
dtype: int64

## Pandas Series

In [52]:
import pandas as pd
s = pd.Series([21000,18900,18000])
s

0    21000
1    18900
2    18000
dtype: int64

In [53]:
s = pd.Series([21000,18900,18000], index = ['IPhone', 'Edge S7', 'HTC M1'])
s

IPhone     21000
Edge S7    18900
HTC M1     18000
dtype: int64

In [54]:
s= pd.Series({'IPhone':21000,'Edge S7':18900,'HTC M1':18000})
s

Edge S7    18900
HTC M1     18000
IPhone     21000
dtype: int64

In [56]:
s[2]

21000

In [57]:
s[1:3]

HTC M1    18000
IPhone    21000
dtype: int64

In [58]:
s['IPhone']

21000

In [59]:
s[['IPhone', 'Edge S7']]

IPhone     21000
Edge S7    18900
dtype: int64

In [60]:
s < 20000

Edge S7     True
HTC M1      True
IPhone     False
dtype: bool

In [61]:
s[s<20000]

Edge S7    18900
HTC M1     18000
dtype: int64

In [62]:
cheap = s < 20000
cheap

Edge S7     True
HTC M1      True
IPhone     False
dtype: bool

In [63]:
s[cheap]

Edge S7    18900
HTC M1     18000
dtype: int64

In [66]:
s['IPhone'] = 20000

In [67]:
s

Edge S7    18900
HTC M1     18000
IPhone     20000
dtype: int64

In [70]:
s[s < 20000] = s[s < 20000] * 0.8

In [71]:
s

Edge S7    15120
HTC M1     14400
IPhone     20000
dtype: int64

In [73]:
'IPhone' in s

True

In [74]:
'mi' in s

False

In [76]:
s *0.8

Edge S7    12096.0
HTC M1     11520.0
IPhone     16000.0
dtype: float64

In [77]:
import numpy as np
np.sqrt(s)

Edge S7    122.963409
HTC M1     120.000000
IPhone     141.421356
dtype: float64

In [79]:
s.max()

20000

In [80]:
s.min()

14400

In [81]:
s.describe()

count        3.000000
mean     16506.666667
std       3046.659373
min      14400.000000
25%      14760.000000
50%      15120.000000
75%      17560.000000
max      20000.000000
dtype: float64

In [83]:
s[['mi','HTC M1']]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:705: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

mi            NaN
HTC M1    14400.0
dtype: float64

In [85]:
s[['IPhone', 'HTC M1']]

IPhone    20000
HTC M1    14400
dtype: int64

In [86]:
s[['mi','HTC M1']] + s[['IPhone', 'HTC M1']]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:705: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

HTC M1    28800.0
IPhone        NaN
mi            NaN
dtype: float64

In [87]:
s2 = s[['mi','HTC M1']] + s[['IPhone', 'HTC M1']]

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\series.py:705: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

In [89]:
s2.notnull()

HTC M1     True
IPhone    False
mi        False
dtype: bool

In [90]:
s2.isnull()

HTC M1    False
IPhone     True
mi         True
dtype: bool

## DataFrame

In [91]:
df=pd.DataFrame([['frank','M',29],['mary','F',23],['tom','M',35],['ted','M',33],['jean','F',21],['lisa','F',20]])
df.columns=['name','gender','age']

In [92]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [93]:
df=pd.DataFrame([['frank','M',29],['mary','F',23],['tom','M',35],['ted','M',33],['jean','F',21],['lisa','F',20]],columns=['name','gender','age'])

In [94]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [98]:
df=pd.DataFrame([{'name':'frank','gender':'M','age':29},\
                 {'name':'mary','gender':'F','age':23},\
                 {'name':'tom','gender':'M','age':35},\
                 {'name':'ted','gender':'M','age':33},\
                 {'name':'jean','gender':'F','age':21},\
                 {'name':'lisa','gender':'F','age':20}])
df

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa

In [97]:
a = {'name':'qoo', 'gender': 'M', 'age': 20}
b = {'name':'Mary', 'gender': 'F'}
df2 = pd.DataFrame([a,b])
df2

    age gender  name
0  20.0      M   qoo
1   NaN      F  Mary

In [99]:
df.head()

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean

In [100]:
df.head(3)

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom

In [101]:
df.tail(5)

   age gender  name
1   23      F  mary
2   35      M   tom
3   33      M   ted
4   21      F  jean
5   20      F  lisa

In [102]:
df.tail(3)

   age gender  name
3   33      M   ted
4   21      F  jean
5   20      F  lisa

In [103]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
age       6 non-null int64
gender    6 non-null object
name      6 non-null object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [104]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [105]:
df.dtypes

age        int64
gender    object
name      object
dtype: object

In [106]:
df.ix[1]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

age         23
gender       F
name      mary
Name: 1, dtype: object

In [109]:
df.iloc[2]

age        35
gender      M
name      tom
Name: 2, dtype: object

In [110]:
df.loc[2]

age        35
gender      M
name      tom
Name: 2, dtype: object

In [112]:
df.index = range(101,107)
df

     age gender   name
101   29      M  frank
102   23      F   mary
103   35      M    tom
104   33      M    ted
105   21      F   jean
106   20      F   lisa

In [115]:
df.index

RangeIndex(start=101, stop=107, step=1)

In [113]:
df.iloc[2]

age        35
gender      M
name      tom
Name: 103, dtype: object

In [116]:
df.loc[103]

age        35
gender      M
name      tom
Name: 103, dtype: object

In [118]:
df['name']

101    frank
102     mary
103      tom
104      ted
105     jean
106     lisa
Name: name, dtype: object

In [119]:
df[['name', 'age']]

      name  age
101  frank   29
102   mary   23
103    tom   35
104    ted   33
105   jean   21
106   lisa   20

In [121]:
# loc => by index name
df.loc[ [101,102] , ['name', 'age']   ]

      name  age
101  frank   29
102   mary   23

In [124]:
# iloc => by index position
df.iloc[1:3, [1,2]]

    gender  name
102      F  mary
103      M   tom

In [129]:
df['gender'] == 'M'

101     True
102    False
103     True
104     True
105    False
106    False
Name: gender, dtype: bool

In [128]:
df[df['gender'] == 'M']

     age gender   name
101   29      M  frank
103   35      M    tom
104   33      M    ted

In [131]:
df['gender'] == 'M'

101     True
102    False
103     True
104     True
105    False
106    False
Name: gender, dtype: bool

In [132]:
df['age'] >= 30

101    False
102    False
103     True
104     True
105    False
106    False
Name: age, dtype: bool

In [134]:
(df['gender'] == 'M') & (df['age'] >= 30)

101    False
102    False
103     True
104     True
105    False
106    False
dtype: bool

In [135]:
df[(df['gender'] == 'M') & (df['age'] >= 30)]

     age gender name
103   35      M  tom
104   33      M  ted

In [136]:
(df['gender'] == 'M') | (df['age'] >= 30)

101     True
102    False
103     True
104     True
105    False
106    False
dtype: bool

In [137]:
df[(df['gender'] == 'M') | (df['age'] >= 30)]

     age gender   name
101   29      M  frank
103   35      M    tom
104   33      M    ted

In [139]:
df['employee'] = True

In [140]:
df

     age gender   name  employee
101   29      M  frank      True
102   23      F   mary      True
103   35      M    tom      True
104   33      M    ted      True
105   21      F   jean      True
106   20      F   lisa      True

In [141]:
del df['employee']

In [142]:
df

     age gender   name
101   29      M  frank
102   23      F   mary
103   35      M    tom
104   33      M    ted
105   21      F   jean
106   20      F   lisa

In [143]:
df['employee'] = True
df

     age gender   name  employee
101   29      M  frank      True
102   23      F   mary      True
103   35      M    tom      True
104   33      M    ted      True
105   21      F   jean      True
106   20      F   lisa      True

In [146]:
# method 1
#df = df.drop('employee', axis = 1)

# method 2
df.drop('employee', axis = 1, inplace=True)

In [148]:
# by name
df.loc[6]={'age':20,'gender':'F','name':'qoo'}
df

     age gender   name
101   29      M  frank
102   23      F   mary
103   35      M    tom
104   33      M    ted
105   21      F   jean
106   20      F   lisa
6     20      F    qoo

In [151]:
df.append(pd.DataFrame([{'age':30,'gender':'F','name':'oop'}]),ignore_index=True)

   age gender   name
0   29      M  frank
1   23      F   mary
2   35      M    tom
3   33      M    ted
4   21      F   jean
5   20      F   lisa
6   20      F    qoo
7   30      F    oop

In [154]:
df = df.append(pd.DataFrame([{'age':30,'gender':'F','name':'oop'}]),ignore_index=False)

In [157]:
df.drop(6, inplace=True)

In [160]:
df.drop(0, inplace=True)

In [161]:
df

     age gender   name
101   29      M  frank
102   23      F   mary
103   35      M    tom
104   33      M    ted
105   21      F   jean
106   20      F   lisa

In [162]:
df['userid'] = range(101,107)
df

     age gender   name  userid
101   29      M  frank     101
102   23      F   mary     102
103   35      M    tom     103
104   33      M    ted     104
105   21      F   jean     105
106   20      F   lisa     106

In [163]:
df.set_index('userid', inplace=True)

In [164]:
df

        age gender   name
userid
101      29      M  frank
102      23      F   mary
103      35      M    tom
104      33      M    ted
105      21      F   jean
106      20      F   lisa

In [165]:
# iloc : by pos
# loc  : by name

In [166]:
df.iloc[1]

age         23
gender       F
name      mary
Name: 102, dtype: object

In [168]:
df.iloc[[1,3,5]]

        age gender  name
userid
102      23      F  mary
104      33      M   ted
106      20      F  lisa

In [170]:
df.loc[[101,103,105]]

        age gender   name
userid
101      29      M  frank
103      35      M    tom
105      21      F   jean

In [176]:
df.loc[ df['gender']=='M' , ['gender', 'age'] ]

       gender  age
userid
101         M   29
103         M   35
104         M   33

## 處理缺失值

In [177]:
import pandas as pd
import numpy as np

df=pd.DataFrame([\
                 ['frank','M',np.nan],\
                 ['mary',np.nan,np.nan],\
                 ['tom','M',35],\
                 ['ted','M',33],\
                 ['jean',np.nan,21],\
                 ['lisa','F',20]])

df.columns=['name','gender','age']

df

    name gender   age
0  frank      M   NaN
1   mary    NaN   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [179]:
df['age'].sum()

109.0

In [180]:
df['gender'].notnull()

0     True
1    False
2     True
3     True
4    False
5     True
Name: gender, dtype: bool

In [181]:
df['gender'].isnull()

0    False
1     True
2    False
3    False
4     True
5    False
Name: gender, dtype: bool

In [182]:
# recommended method
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [183]:
# not recommended
df.name

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [185]:
df['name'].isnull().values.any()

False

In [186]:
df.isnull().values.any()

True

In [187]:
df.isnull().sum()

name      0
gender    2
age       2
dtype: int64

In [188]:
df.isnull().sum().sum()

4

In [194]:
df.dropna()

# df = df.dropna()
# df.dropna(inplace=True)

   name gender   age
2   tom      M  35.0
3   ted      M  33.0
5  lisa      F  20.0

In [196]:
df.dropna(how = 'all')

    name gender   age
0  frank      M   NaN
1   mary    NaN   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [197]:
df.dropna(thresh = 2)

    name gender   age
0  frank      M   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [198]:
df['employee'] = np.nan

In [199]:
df

    name gender   age  employee
0  frank      M   NaN       NaN
1   mary    NaN   NaN       NaN
2    tom      M  35.0       NaN
3    ted      M  33.0       NaN
4   jean    NaN  21.0       NaN
5   lisa      F  20.0       NaN

In [202]:
# axis: 0 by row, 1 by col  ; default axis :0
df.dropna(axis = 1, how = 'all', inplace=True)

In [204]:
df.fillna(0)

    name gender   age
0  frank      M   0.0
1   mary      0   0.0
2    tom      M  35.0
3    ted      M  33.0
4   jean      0  21.0
5   lisa      F  20.0

In [205]:
df['age'].fillna(0)

0     0.0
1     0.0
2    35.0
3    33.0
4    21.0
5    20.0
Name: age, dtype: float64

In [208]:
df['age'].fillna(df['age'].mean())

0    27.25
1    27.25
2    35.00
3    33.00
4    21.00
5    20.00
Name: age, dtype: float64

In [210]:
# select gender, avg(age) from df group by gender
df.groupby('gender')['age'].mean()

gender
F    20.0
M    34.0
Name: age, dtype: float64

In [212]:
df.groupby('gender')['age'].transform('mean')

0    34.0
1     NaN
2    34.0
3    34.0
4     NaN
5    20.0
Name: age, dtype: float64

In [214]:
df['age'].fillna(df.groupby('gender')['age'].transform('mean'))

0    34.0
1     NaN
2    35.0
3    33.0
4    21.0
5    20.0
Name: age, dtype: float64

In [216]:
df

    name gender   age
0  frank      M   NaN
1   mary    NaN   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [215]:
df.fillna(method='pad')

    name gender   age
0  frank      M   NaN
1   mary      M   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean      M  21.0
5   lisa      F  20.0

In [217]:
df.fillna(method='bfill')

    name gender   age
0  frank      M  35.0
1   mary      M  35.0
2    tom      M  35.0
3    ted      M  33.0
4   jean      F  21.0
5   lisa      F  20.0

In [218]:
df.fillna(method='bfill', limit = 1)

    name gender   age
0  frank      M   NaN
1   mary      M  35.0
2    tom      M  35.0
3    ted      M  33.0
4   jean      F  21.0
5   lisa      F  20.0

In [219]:
df2=pd.DataFrame([[1,870],\
                  [2,900],\
                  [np.nan,np.nan],\
                  [4,950],\
                  [5,1080],\
                  [6,1200]])
df2.columns=['time','val']
df2.interpolate()

   time     val
0   1.0   870.0
1   2.0   900.0
2   3.0   925.0
3   4.0   950.0
4   5.0  1080.0
5   6.0  1200.0

## 數據轉換

In [223]:
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/rent_591_sample.csv',index_col=0)
df.head()

,id,address,floor,allfloor,layout,area,price,browsenum_all
0,6032971,永康街47巷永康街五樓頂加..,5,5,5房3廳3衛,46.8,"60,000",751
1,6054083,仁愛路四段仁愛路樹海景觀..,7,12,4房2廳2衛,76.9,"100,000",162
2,5957980,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,"150,000",2385
3,6043839,永康街23巷永康商圈..,3,4,2房1廳1衛,18.0,"29,000",1323
4,5181793,雲和街師大*已收訂..,5,5,2房2廳1衛,28.0,"31,800",2303

In [226]:
df['area'].head() / 0.3025

0    154.710744
1    254.214876
2    235.702479
3     59.504132
4     92.561983
Name: area, dtype: float64

In [227]:
import numpy as np
np.sqrt(df['area'].head())

0    6.841053
1    8.769265
2    8.443933
3    4.242641
4    5.291503
Name: area, dtype: float64

In [228]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 720 entries, 0 to 29
Data columns (total 8 columns):
id               720 non-null int64
address          720 non-null object
floor            720 non-null int64
allfloor         720 non-null int64
layout           720 non-null object
area             720 non-null float64
price            720 non-null object
browsenum_all    720 non-null int64
dtypes: float64(1), int64(4), object(3)
memory usage: 70.6+ KB

In [230]:
df['address'].head() + '-' + df['price'].head()

0    永康街47巷永康街五樓頂加..-60,000
1    仁愛路四段仁愛路樹海景觀..-100,000
2    光復南路高樓層大巨蛋正對..-150,000
3       永康街23巷永康商圈..-29,000
4        雲和街師大*已收訂..-31,800
dtype: object

In [231]:
df['square_feet']=df['area']/0.3025

In [232]:
df.head()

,id,address,floor,allfloor,layout,area,price,browsenum_all,square_feet
0,6032971,永康街47巷永康街五樓頂加..,5,5,5房3廳3衛,46.8,"60,000",751,154.710744
1,6054083,仁愛路四段仁愛路樹海景觀..,7,12,4房2廳2衛,76.9,"100,000",162,254.214876
2,5957980,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,"150,000",2385,235.702479
3,6043839,永康街23巷永康商圈..,3,4,2房1廳1衛,18.0,"29,000",1323,59.504132
4,5181793,雲和街師大*已收訂..,5,5,2房2廳1衛,28.0,"31,800",2303,92.561983

In [236]:
p = '60,000'
int(p.replace(',', ''))

60000

In [237]:
def normalizePrice(ele):
    return int(ele.replace(',', ''))

In [240]:
df['price'].map(normalizePrice).head()

0     60000
1    100000
2    150000
3     29000
4     31800
Name: price, dtype: int64

In [241]:
df['price'].map(lambda ele: int(ele.replace(',', ''))).head()

0     60000
1    100000
2    150000
3     29000
4     31800
Name: price, dtype: int64

In [247]:
df=pandas.DataFrame([[60,70,50],\
                      [80,79,68],\
                      [63,66,82]],\
                    columns=['First','Second','Third'])

In [252]:
df.apply(lambda e: e.max() - e.min(), axis=1)

0    20
1    12
2    19
dtype: int64

In [253]:
df.apply(lambda e: e.max() - e.min(), axis=0)

First     20
Second    13
Third     32
dtype: int64

In [255]:
df.applymap(lambda e: e * 10)

   First  Second  Third
0    600     700    500
1    800     790    680
2    630     660    820

## 處理時間格式資料

In [256]:
from datetime import datetime
current_time = datetime.now()

In [257]:
current_time

datetime.datetime(2018, 4, 22, 13, 58, 28, 544631)

In [258]:
current_time.strftime('%Y-%m-%d')

'2018-04-22'

In [260]:
dt = datetime.strptime('2018/01/05', '%Y/%m/%d')

In [261]:
current_time - dt

datetime.timedelta(107, 50308, 544631)

In [264]:
from datetime import datetime, timedelta

current_time - timedelta(days = 1)

datetime.datetime(2018, 4, 21, 13, 58, 28, 544631)

In [267]:
for i in range(0,10):
    #print(current_time - timedelta(days = i))
    dt = current_time - timedelta(days = i)
    print(dt.strftime('%Y/%m/%d'))

2018/04/22
2018/04/21
2018/04/20
2018/04/19
2018/04/18
2018/04/17
2018/04/16
2018/04/15
2018/04/14
2018/04/13

In [270]:
from time import mktime
mktime(current_time.timetuple())

1524376708.0

In [271]:
datetime.fromtimestamp(1524376708)

datetime.datetime(2018, 4, 22, 13, 58, 28)

In [280]:
datetime.fromtimestamp(86400)

datetime.datetime(1970, 1, 2, 8, 0)

In [282]:
import pandas
df = pandas.read_csv('https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/rent_591_sample.csv',index_col=0)
df.head()

,id,address,floor,allfloor,layout,area,price,browsenum_all
0,6032971,永康街47巷永康街五樓頂加..,5,5,5房3廳3衛,46.8,"60,000",751
1,6054083,仁愛路四段仁愛路樹海景觀..,7,12,4房2廳2衛,76.9,"100,000",162
2,5957980,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,"150,000",2385
3,6043839,永康街23巷永康商圈..,3,4,2房1廳1衛,18.0,"29,000",1323
4,5181793,雲和街師大*已收訂..,5,5,2房2廳1衛,28.0,"31,800",2303

In [283]:
df['search_date'] = '2018/04/22'

In [284]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 720 entries, 0 to 29
Data columns (total 9 columns):
id               720 non-null int64
address          720 non-null object
floor            720 non-null int64
allfloor         720 non-null int64
layout           720 non-null object
area             720 non-null float64
price            720 non-null object
browsenum_all    720 non-null int64
search_date      720 non-null object
dtypes: float64(1), int64(4), object(4)
memory usage: 56.2+ KB

In [288]:
pandas.to_datetime(df['search_date'], format = '%Y/%m/%d').head()

0   2018-04-22
1   2018-04-22
2   2018-04-22
3   2018-04-22
4   2018-04-22
Name: search_date, dtype: datetime64[ns]